In [1]:
from pyspark.sql.functions import col, expr, lit
from pyspark.sql import SparkSession, Row

spark = SparkSession.builder.appName("RowExample").getOrCreate()

your 131072x1 screen size is bogus. expect trouble
25/08/19 15:00:59 WARN Utils: Your hostname, KLZPC0015 resolves to a loopback address: 127.0.1.1; using 172.25.17.96 instead (on interface eth0)
25/08/19 15:00:59 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/08/19 15:01:02 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
25/08/19 15:01:04 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [2]:
data = [
    (1, "Manta", 75000, "IT", 24),
    (2, "Dipankar", 30000, "Post Master", 27),
    (3, "Souvik", 60000, "Army Officer", 27),
    (4, "Soukarjya", 45000, "BDO", 26),
    (5, "Arvind", 35000, "Business Data Analyst", 28)
]

In [3]:
df = spark.createDataFrame(data, ["id", "name", "salary", "department", "age"])
df.show()

+---+---------+------+--------------------+---+
| id|     name|salary|          department|age|
+---+---------+------+--------------------+---+
|  1|    Manta| 75000|                  IT| 24|
|  2| Dipankar| 30000|         Post Master| 27|
|  3|   Souvik| 60000|        Army Officer| 27|
|  4|Soukarjya| 45000|                 BDO| 26|
|  5|   Arvind| 35000|Business Data Ana...| 28|
+---+---------+------+--------------------+---+

In [4]:
df_new = df.withColumn("bonus", lit(1000))
print("DataFrame after adding 'bonus' column: ")
df_new.show()

DataFrame after adding 'bonus' column:

+---+---------+------+--------------------+---+-----+
| id|     name|salary|          department|age|bonus|
+---+---------+------+--------------------+---+-----+
|  1|    Manta| 75000|                  IT| 24| 1000|
|  2| Dipankar| 30000|         Post Master| 27| 1000|
|  3|   Souvik| 60000|        Army Officer| 27| 1000|
|  4|Soukarjya| 45000|                 BDO| 26| 1000|
|  5|   Arvind| 35000|Business Data Ana...| 28| 1000|
+---+---------+------+--------------------+---+-----+

In [5]:
df_updated = df_new.withColumn("salary", col("salary") * 1.10)
print("DataFrame after updating 'salary' column: ")
df_updated.show()

DataFrame after updating 'salary' column:

+---+---------+-----------------+--------------------+---+-----+
| id|     name|           salary|          department|age|bonus|
+---+---------+-----------------+--------------------+---+-----+
|  1|    Manta|          82500.0|                  IT| 24| 1000|
|  2| Dipankar|          33000.0|         Post Master| 27| 1000|
|  3|   Souvik|          66000.0|        Army Officer| 27| 1000|
|  4|Soukarjya|49500.00000000001|                 BDO| 26| 1000|
|  5|   Arvind|          38500.0|Business Data Ana...| 28| 1000|
+---+---------+-----------------+--------------------+---+-----+

In [6]:
df_expr = df_updated.withColumn("salary_with_bonus", expr("salary + bonus"))
print("DataFrame after updating after using an expression: ")
df_expr.show()

DataFrame after updating after using an expression:

+---+---------+-----------------+--------------------+---+-----+-----------------+
| id|     name|           salary|          department|age|bonus|salary_with_bonus|
+---+---------+-----------------+--------------------+---+-----+-----------------+
|  1|    Manta|          82500.0|                  IT| 24| 1000|          83500.0|
|  2| Dipankar|          33000.0|         Post Master| 27| 1000|          34000.0|
|  3|   Souvik|          66000.0|        Army Officer| 27| 1000|          67000.0|
|  4|Soukarjya|49500.00000000001|                 BDO| 26| 1000|50500.00000000001|
|  5|   Arvind|          38500.0|Business Data Ana...| 28| 1000|          39500.0|
+---+---------+-----------------+--------------------+---+-----+-----------------+

In [7]:
df_type_changed = df_expr.withColumn("salary", col("salary").cast("Integer"))
print("DtaFrame after changing 'salary' column type: ")
df_type_changed.show()

DtaFrame after changing 'salary' column type:

+---+---------+------+--------------------+---+-----+-----------------+
| id|     name|salary|          department|age|bonus|salary_with_bonus|
+---+---------+------+--------------------+---+-----+-----------------+
|  1|    Manta| 82500|                  IT| 24| 1000|          83500.0|
|  2| Dipankar| 33000|         Post Master| 27| 1000|          34000.0|
|  3|   Souvik| 66000|        Army Officer| 27| 1000|          67000.0|
|  4|Soukarjya| 49500|                 BDO| 26| 1000|50500.00000000001|
|  5|   Arvind| 38500|Business Data Ana...| 28| 1000|          39500.0|
+---+---------+------+--------------------+---+-----+-----------------+

In [10]:
# df_renamed = df_type_changed.withColumn("emp_name", col("emp_name")).drop("name")
# print("DataFrame after renaming 'name' column to 'emp_name': ")
# df_renamed.show()


df_renamed = df_type_changed.withColumnRenamed("name", "emp_name")
print("DataFrame after renaming 'name' column to 'emp_name':")
df_renamed.show()

DataFrame after renaming 'name' column to 'emp_name':

+---+---------+------+--------------------+---+-----+-----------------+
| id| emp_name|salary|          department|age|bonus|salary_with_bonus|
+---+---------+------+--------------------+---+-----+-----------------+
|  1|    Manta| 82500|                  IT| 24| 1000|          83500.0|
|  2| Dipankar| 33000|         Post Master| 27| 1000|          34000.0|
|  3|   Souvik| 66000|        Army Officer| 27| 1000|          67000.0|
|  4|Soukarjya| 49500|                 BDO| 26| 1000|50500.00000000001|
|  5|   Arvind| 38500|Business Data Ana...| 28| 1000|          39500.0|
+---+---------+------+--------------------+---+-----+-----------------+

In [12]:
from pyspark.sql.functions import col, lit

df1 = (
    df_type_changed
    .withColumn("emp_name_test", col("name"))   # use existing "name"
    .drop("name")                               # drop the old column
    .withColumn("salary", col("salary").cast("Integer"))  # proper cast
    .withColumn("bonus1", lit(1000))            # add new column
)

print("DataFrame after renaming 'name' column to 'emp_name_test': ")
df1.show()

DataFrame after renaming 'name' column to 'emp_name_test':

+---+------+--------------------+---+-----+-----------------+-------------+------+
| id|salary|          department|age|bonus|salary_with_bonus|emp_name_test|bonus1|
+---+------+--------------------+---+-----+-----------------+-------------+------+
|  1| 82500|                  IT| 24| 1000|          83500.0|        Manta|  1000|
|  2| 33000|         Post Master| 27| 1000|          34000.0|     Dipankar|  1000|
|  3| 66000|        Army Officer| 27| 1000|          67000.0|       Souvik|  1000|
|  4| 49500|                 BDO| 26| 1000|50500.00000000001|    Soukarjya|  1000|
|  5| 38500|Business Data Ana...| 28| 1000|          39500.0|       Arvind|  1000|
+---+------+--------------------+---+-----+-----------------+-------------+------+